
create table purchase(
	id int primary key IDENTITY(1,1) NOT NULL,
	order_number int NOT NULL,
	member_id varchar(10) NOT NULL,
	order_address nvarchar(50),
	order_date datetime default getdate(),
	pickup_date datetime,
	order_total int,
	chicken int,
	pork int,
	beef int,
	lamb int,
	fish int,
  extra_chicken int,
  extra_pork int,
  extra_beef int,
  extra_lamb int,
  extra_fish int
  );

insert into purchase 
values
(10001, '0988111111','台北市', '', '2023-10-10', 300, 1, 3 , 4, 8, 2, 6, 2, 2, 1, 1),
(10002, '0988222222','台北市', '', '2023-10-11', 1200, 2, 2 , 4, 2, 1, 1, 3, 5, 2, 1),
(10003, '0988333333','台北市', '', '2023-10-13', 600, 6, 3 , 4, 5, 6, 3, 2, 1, 4, 1),
(10004, '0988444444','台北市', '', '2023-10-15', 400, 3, 1 , 4, 1, 4, 6, 4, 3, 2, 1),
(10005, '0988555555','台北市', '', '2023-10-17', 700, 2, 2 , 4, 5, 2, 2, 8, 2, 1, 1),
(10006, '0988666666','台北市', '', '2023-10-13', 400, 5, 3 , 4, 1, 6, 5, 5, 3, 3, 1),
(10007, '0988777777','台北市', '', '2023-10-15', 900, 5, 1 , 4, 5, 1, 2, 8, 3, 2, 1),
(10008, '0988111111','台北市', '', '2023-10-16', 880, 2, 5 , 4, 7, 6, 3, 1, 6, 3, 1),
(10009, '0988222222','台北市', '', '2023-10-17', 500, 1, 3 , 4, 6, 5, 4, 3, 3, 1, 1),
(10010, '0988333333','台北市', '', '2023-10-20', 1000, 2, 2 , 4, 3, 4, 2, 1, 7, 2, 1),
(10011, '0988555555','台北市', '', '2023-10-15', 700, 7, 2 , 3, 5, 2, 2, 8, 2, 1, 1),
(10012, '0988555555','台北市', '', '2023-10-19', 200, 2, 1 , 4, 5, 3, 2, 8, 2, 1, 1);


select * from purchase;


truncate table purchase;
  drop table purchase;